9/data/attachments/5e8d789714031ffd.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_fab22856-611d-4f4b-9475-f7710b7ccd0a</nif:username>
            <nif:friendToBeAdded>David_wait_Friend_25416_9</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>